DataProcessors/Лео_ЗагрузкаНоменклатурыИзШаблона/Лео_ЗагрузкаНоменклатурыИзШаблона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_ЗагрузкаНоменклатурыИзШаблона</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФильтрРасширенияФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <comment>(Общ)</comment>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Ставка НДС 5%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
    <comment>Расчетная ставка НДС 5/105</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Ставка НДС 7%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
    <comment>Расчетная ставка НДС 7/107</comment>
  </enumValues>
</mdclass:Enum>

Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиОперативныйУчетОстатковНЗП</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПартионныйУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериямВНЗП</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВоспроизводства</name>
    <comment>(Упр)</comment>
    <type>
      <types>EnumRef.ВидыВоспроизводстваНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Набор</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеИспользования</name>
    <type>
      <types>CatalogRef.НазначенияИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджерЗаПокупки</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнешняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнутренняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВыпуска</name>
    <type>
      <types>EnumRef.НаправленияВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеСписанияВыпущеннойПродукции</name>
    <type>
      <types>CatalogRef.НаправленияСписанияВыпущеннойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПрисвоенияСерийногоНомера</name>
    <type>
      <types>CatalogRef.ПорядокПрисвоенияСерийныхНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКП</name>
    <comment>Общероссийский классификатор продукции</comment>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияМест</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатурыВФорматеHTML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусНоменклатуры</name>
    <type>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РотацияНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеИспользоватьПриПодборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ТУ</name>
    <type>
      <types>CatalogRef.Лео_ТехническиеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ТипУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ОрганолептическиеПоказатели</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказателиБезопасности</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ФормаВыпуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ВнешнийВид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказательЭффективности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ИмяСпец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОперативныйСтатусНоменклатуры</name>
    <type>
      <types>CatalogRef.Лео_ОперативныйСтатусНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_ДопДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_белки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_жиры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_углеводы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_КК</name>
    <comment>Энергетическая ценность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Аллерген</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_АдресХранения</name>
    <type>
      <types>CatalogRef.Лео_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_РодительНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_НоменклатураДляЗамены</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СДИЗ</name>
    <comment>сопроводительный документ по идентификации зерна</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Замес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_АртикулыПокупателя</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПокупателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DataProcessors/Лео_ЗагрузкаНоменклатурыИзШаблона/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ФильтрРасширенияФайлов = "" Тогда
		Объект.ФильтрРасширенияФайлов = "Документ Exel (*.xls)|*.xls|Документ Exel 2007(*.xlsx)|*.xlsx";
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Exel(*.xls)|*.xls|Документ Exel 2007(*.xmlx)|*.xlsx";//Объект.ФильтрРасширенияФайлов;
	Если Диалог.Выбрать() Тогда
		Объект.ИмяФайла = Диалог.ПолноеИмяФайла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	Ф=Новый Файл(СокрЛП(Объект.ИмяФайла));
	Если Ф.Существует()=0 Тогда
		Сообщить("Указанный файл не существует!");
		Возврат;
	КонецЕсли;
	ВыбФайл = Новый Файл(Объект.ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		Объект.РасширениеФайла = ВыбФайл.Расширение;
		Объект.ID = ВыбФайл.ИмяБезРасширения;
	КонецЕсли;
	
	ДвоичныйФайл = ПоместитьВоВременноеХранилище ( Новый ДвоичныеДанные(Объект.ИмяФайла),ЭтаФорма.УникальныйИдентификатор); 
	ПолучитьФайлНаСервере(ДвоичныйФайл);

КонецПроцедуры


&НаСервере
Процедура ПолучитьФайлНаСервере(ДвоичныйФайл);
	
	ДанныеДокумента = ПолучитьИзВременногоХранилища(ДвоичныйФайл);
	ИмяФайлаДляЗагрузки = КаталогВременныхФайлов()+"temp" + Объект.ID + Объект.РасширениеФайла;
	ДанныеДокумента.Записать(ИмяФайлаДляЗагрузки);

	
	ФайлEXCEL = ИмяФайлаДляЗагрузки ;
	ИмяЛиста = "Лист1";
	КолвоСтрокExcel = 1;
	СписокНоменклатуры = ЗагрузитьМетодом_MSADODB(ФайлEXCEL,ИмяЛиста,1,,, КолвоСтрокExcel,"MicrosoftACEOLEDB12");
	
	НоменклатурныеПозиции = Новый ТаблицаЗначений;
	
	НоменклатурныеПозиции.Колонки.Добавить("Артикул");                   //К_2
	НоменклатурныеПозиции.Колонки.Добавить("Справочник");                //К_3
	НоменклатурныеПозиции.Колонки.Добавить("ВидНоменклатуры");           //К_4
	НоменклатурныеПозиции.Колонки.Добавить("Категория");                 //К_5
	НоменклатурныеПозиции.Колонки.Добавить("Подкатегория1");             //К_6
	НоменклатурныеПозиции.Колонки.Добавить("Подкатегория2");             //К_7
	НоменклатурныеПозиции.Колонки.Добавить("Наименование");              //К_8
	НоменклатурныеПозиции.Колонки.Добавить("КраткоеНаименование");       //К_9
	НоменклатурныеПозиции.Колонки.Добавить("КодОКП");                    //К_10
	НоменклатурныеПозиции.Колонки.Добавить("КодВЭД");                    //К_11
	НоменклатурныеПозиции.Колонки.Добавить("СрокГодности");              //К_12
	НоменклатурныеПозиции.Колонки.Добавить("ТеператураХранения");        //К_13
	НоменклатурныеПозиции.Колонки.Добавить("ШК_EAN13");                  //К_14
	НоменклатурныеПозиции.Колонки.Добавить("ШК_Блок");                   //К_15
	НоменклатурныеПозиции.Колонки.Добавить("ШК_ITF14");                  //К_16
	НоменклатурныеПозиции.Колонки.Добавить("ТипУпак_Потребительская");   //К_17
	НоменклатурныеПозиции.Колонки.Добавить("ТипУпак_Блок");              //К_18
	НоменклатурныеПозиции.Колонки.Добавить("ТипУпак_Групповая");         //К_19
	НоменклатурныеПозиции.Колонки.Добавить("ПУ_Длинна");                 //К_20
	НоменклатурныеПозиции.Колонки.Добавить("ПУ_Ширина");                 //К_21
	НоменклатурныеПозиции.Колонки.Добавить("ПУ_Высота");                 //К_22
	НоменклатурныеПозиции.Колонки.Добавить("Масса_Нетто");               //К_23
	НоменклатурныеПозиции.Колонки.Добавить("Масса_Брутто");              //К_24
	НоменклатурныеПозиции.Колонки.Добавить("Масса_Брутто_ВесУпаковки");  //К_25
	НоменклатурныеПозиции.Колонки.Добавить("КоличествоВБлоке");          //К_26
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Блок_Длинна");            //К_27
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Блок_Ширина");            //К_28
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Блок_Высота");            //К_29
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Блок_Нетто");             //К_30
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Блок_Брутто");            //К_31
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Блок_шт");                //К_32
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Длинна");                 //К_33
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Ширина");                 //К_34
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Высота");                 //К_35
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_Колво_ИндУпак");          //К_36
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_МассаКороба_Нетто");      //К_37
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_МассаКороба_Брутто");     //К_38
	НоменклатурныеПозиции.Колонки.Добавить("ГУ_ВесТарыБезВложений");     //К_39
	НоменклатурныеПозиции.Колонки.Добавить("Паллетрование_КолвоКоробовНаПаллете");  //К_40
	НоменклатурныеПозиции.Колонки.Добавить("Паллетрование_КолвоЕдУпакНаПаллете");   //К_41
	НоменклатурныеПозиции.Колонки.Добавить("Паллетрование_КолвоКорбовВРяду");       //К_42
	НоменклатурныеПозиции.Колонки.Добавить("Паллетрование_КолвоРядов");             //К_43
	НоменклатурныеПозиции.Колонки.Добавить("Паллетрование_ВысотаПаллеты");          //К_44
	НоменклатурныеПозиции.Колонки.Добавить("НДС");                                  //К_45
	НоменклатурныеПозиции.Колонки.Добавить("НП");                                   //К_46
	НоменклатурныеПозиции.Колонки.Добавить("Примечания");                           //К_47
	НоменклатурныеПозиции.Колонки.Добавить("Дата");                                 //К_48
		
	Для каждого Строка из СписокНоменклатуры Цикл
		
		Если СокрЛП(Строка.К_3) = "Номенклатура" Тогда
					
			ТекСтр = НоменклатурныеПозиции.Добавить();
			ТекСтр.Артикул                             = Строка.К_2;
			ТекСтр.Справочник                          = Строка.К_3;
			ТекСтр.ВидНоменклатуры                     = Строка.К_4;
			ТекСтр.Категория                           = Строка.К_5;
			ТекСтр.Подкатегория1                       = Строка.К_6;
			ТекСтр.Подкатегория2                       = Строка.К_7;
			ТекСтр.Наименование                        = Строка.К_8;
			ТекСтр.КраткоеНаименование                 = Строка.К_9;
			ТекСтр.КодОКП                              = Строка.К_10;
			ТекСтр.КодВЭД                              = Строка.К_11;
			ТекСтр.СрокГодности                        = Строка.К_12;
			ТекСтр.ТеператураХранения                  = Строка.К_13;
			ТекСтр.ШК_EAN13                            = Строка.К_14;
			ТекСтр.ШК_Блок                             = Строка.К_15;               
			ТекСтр.ШК_ITF14                            = Строка.К_16;
			ТекСтр.ТипУпак_Потребительская             = Строка.К_17;
			ТекСтр.ТипУпак_Блок                        = Строка.К_18;
			ТекСтр.ТипУпак_Групповая                   = Строка.К_19;
			ТекСтр.ПУ_Длинна                           = Строка.К_20;
			ТекСтр.ПУ_Ширина                           = Строка.К_21;
			ТекСтр.ПУ_Высота                           = Строка.К_22;
			ТекСтр.Масса_Нетто                         = Строка.К_23;
			ТекСтр.Масса_Брутто                        = Строка.К_24;
			ТекСтр.Масса_Брутто_ВесУпаковки            = Строка.К_25;
			ТекСтр.КоличествоВБлоке                    = Строка.К_26;
			ТекСтр.ГУ_Блок_Длинна                      = Строка.К_27;
			ТекСтр.ГУ_Блок_Ширина                      = Строка.К_28;
			ТекСтр.ГУ_Блок_Высота                      = Строка.К_29;
			ТекСтр.ГУ_Блок_Нетто                       = Строка.К_30;
			ТекСтр.ГУ_Блок_Брутто                      = Строка.К_31;
			ТекСтр.ГУ_Блок_шт                          = Строка.К_32;
			ТекСтр.ГУ_Длинна                           = Строка.К_33;
			ТекСтр.ГУ_Ширина                           = Строка.К_34;
			ТекСтр.ГУ_Высота                           = Строка.К_35;
			ТекСтр.ГУ_Колво_ИндУпак                    = Строка.К_36;
			ТекСтр.ГУ_МассаКороба_Нетто                = Строка.К_37;
			ТекСтр.ГУ_МассаКороба_Брутто               = Строка.К_38;
			ТекСтр.ГУ_ВесТарыБезВложений               = Строка.К_39;
			ТекСтр.Паллетрование_КолвоКоробовНаПаллете = Строка.К_40;
			ТекСтр.Паллетрование_КолвоЕдУпакНаПаллете  = Строка.К_41;
			ТекСтр.Паллетрование_КолвоКорбовВРяду      = Строка.К_42;
			ТекСтр.Паллетрование_КолвоРядов            = Строка.К_43;
			ТекСтр.Паллетрование_ВысотаПаллеты         = Строка.К_44;
			ТекСтр.НДС                                 = Строка.К_45;
			ТекСтр.НП                                  = Строка.К_46;
			ТекСтр.Примечания                          = Строка.К_47;
			ТекСтр.Дата                                = Строка.К_48;
		
		КонецЕсли;
	КонецЦикла;	
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Создание карточки номенклатуры/////////////////////////////////////////////////////////////////////////////////////////////////////
	Для каждого Строка из НоменклатурныеПозиции Цикл		
		Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();			
		Номенклатура.Артикул  = Строка.Артикул;
		Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(Строка.ВидНоменклатуры,Истина);
		Номенклатура.Наименование  = Строка.КраткоеНаименование;
		Номенклатура.лео_ИмяСпец = Строка.КраткоеНаименование;
		Номенклатура.НаименованиеПолное  = Строка.Наименование;			
		Номенклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");			
		Номенклатура.ВестиУчетПоСериям = Истина;
		//Номенклатура.ОКП = Строка.КодОКП;
		Номенклатура.ОКП = Справочники.ОбщероссийскийКлассификаторПродукции.НайтиПоНаименованию(Строка.КодОКП,Истина);
		Номенклатура.СтавкаНДС = СтавкаНДС(Строка.НДС);
		Номенклатура.Комментарий = Строка.Примечания;
		Номенклатура.Лео_ОКК_ТипУпаковки = Строка.ТеператураХранения;
			
		Номенклатура.Записать();
		
		НоменклатурнаяПозиция = Номенклатура.Ссылка;
		ПолныйСрокГодностиТовараСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.абс_ПолныйСрокГодностиТовара;
		ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,ПолныйСрокГодностиТовараСвойство,Строка.СрокГодности);
		
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//Создание Едениц измерения//////////////////////////////////////////////////////////////////////////////////////////////////////
		//СоздатьЕдиницуИзмеренияШТ(Номенклатура.Ссылка); 
		
		//ШТУКА		 
		НоменклатурнаяПозиция = Номенклатура.Ссылка;
		Единица = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");	
		попытка
	        НоваяЕдиницаИзмерения                = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	        НоваяЕдиницаИзмерения.Владелец       = НоменклатурнаяПозиция;
	        НоваяЕдиницаИзмерения.Наименование   = Единица.Наименование;
	        НоваяЕдиницаИзмерения.Коэффициент    = 1;
	        НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору = Единица;
			НоваяЕдиницаИзмерения.Вес = Строка.Масса_Брутто;
			НоваяЕдиницаИзмерения.ВесНетто = Строка.Масса_Нетто;
			НоваяЕдиницаИзмерения.ПредупреждатьОНецелыхМестах = Истина;
			НоваяЕдиницаИзмерения.абс_РазрешатьДробноеКоличествоМест = Истина;
			НоваяЕдиницаИзмерения.абс_Ширина = Строка.ПУ_Ширина;    
			НоваяЕдиницаИзмерения.абс_Высота = Строка.ПУ_Высота;
			НоваяЕдиницаИзмерения.абс_Глубина = Строка.ПУ_Длинна; 
			НоваяЕдиницаИзмерения.Объем = Число(Строка.ПУ_Ширина) * Число(Строка.ПУ_Высота) * Число(Строка.ПУ_Длинна);
			
			НоваяЕдиницаИзмерения.абс_ЛинейныеРазмерыПредставление = Строка.ПУ_Ширина + " х " + Строка.ПУ_Высота + " х " + Строка.ПУ_Длинна;
	        НоваяЕдиницаИзмерения.Записать();	
			
			ЕИ = НоваяЕдиницаИзмерения.Ссылка;
			
			Номенклатура.ЕдиницаХраненияОстатков = ЕИ;
			Номенклатура.ЕдиницаДляОтчетов       = ЕИ;
	        Номенклатура.Записать();
	    Исключение
	        Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		// БЛОК
		НоменклатурнаяПозиция = Номенклатура.Ссылка;
		Единица = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("771");	
		попытка
			
			НоваяЕдиницаИзмерения                = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	        НоваяЕдиницаИзмерения.Владелец       = НоменклатурнаяПозиция;
	        НоваяЕдиницаИзмерения.Наименование   = Единица.Наименование;
	        НоваяЕдиницаИзмерения.Коэффициент = Строка.ГУ_Блок_шт;
	        НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору = Единица;
			НоваяЕдиницаИзмерения.Вес = Строка.ГУ_Блок_Брутто;
			НоваяЕдиницаИзмерения.ВесНетто = Строка.ГУ_Блок_Нетто;
			НоваяЕдиницаИзмерения.ПредупреждатьОНецелыхМестах = Истина;
			НоваяЕдиницаИзмерения.абс_РазрешатьДробноеКоличествоМест = Истина;
			НоваяЕдиницаИзмерения.абс_Ширина = Строка.ГУ_Блок_Ширина;    
			НоваяЕдиницаИзмерения.абс_Высота = Строка.ГУ_Блок_Высота;
			НоваяЕдиницаИзмерения.абс_Глубина = Строка.ГУ_Блок_Длинна; 			
			НоваяЕдиницаИзмерения.Объем = Число(Строка.ГУ_Блок_Ширина) * Число(Строка.ГУ_Блок_Высота) * Число(Строка.ГУ_Блок_Длинна);
			
			НоваяЕдиницаИзмерения.абс_ЛинейныеРазмерыПредставление = Строка.ГУ_Блок_Ширина + " х " + Строка.ГУ_Блок_Высота + " х " + Строка.ГУ_Блок_Длинна;
	        НоваяЕдиницаИзмерения.Записать();
			ЕдиницаДляРегистрацииШтрихкодаБлока = НоваяЕдиницаИзмерения;
			
		Исключение
	        Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		//Упаковка
		НоменклатурнаяПозиция = Номенклатура.Ссылка;
		Единица = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("778");	
		Попытка
			
			НоваяЕдиницаИзмерения                = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	        НоваяЕдиницаИзмерения.Владелец       = НоменклатурнаяПозиция;
	        НоваяЕдиницаИзмерения.Наименование   = Единица.Наименование;
	        НоваяЕдиницаИзмерения.Коэффициент = Строка.ГУ_Колво_ИндУпак;
	        НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору = Единица;
			НоваяЕдиницаИзмерения.Вес = Строка.ГУ_МассаКороба_Брутто;
			НоваяЕдиницаИзмерения.ВесНетто = Строка.ГУ_МассаКороба_Нетто;
			НоваяЕдиницаИзмерения.ПредупреждатьОНецелыхМестах = Истина;
			НоваяЕдиницаИзмерения.абс_РазрешатьДробноеКоличествоМест = Истина;
			НоваяЕдиницаИзмерения.абс_Ширина = Строка.ГУ_Ширина;    
			НоваяЕдиницаИзмерения.абс_Высота = Строка.ГУ_Высота;
			НоваяЕдиницаИзмерения.абс_Глубина = Строка.ГУ_Длинна;
			НоваяЕдиницаИзмерения.Объем = Число(Строка.ГУ_Ширина) * Число(Строка.ГУ_Высота) * Число(Строка.ГУ_Длинна);
			
			НоваяЕдиницаИзмерения.абс_ЛинейныеРазмерыПредставление = Строка.ГУ_Ширина + " х " + Строка.ГУ_Высота + " х " + Строка.ГУ_Длинна;
	        НоваяЕдиницаИзмерения.Записать();
			ЕдиницаДляРегистрацииШтрихкодаУпаковки = НоваяЕдиницаИзмерения;
			
		Исключение
	        Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		//Паллет
		
		

	    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//Регистрация штрихкодов/////////////////////////////////////////////////////////////////////////////////////////////////////////
		//Штука
		Если Строка.ШК_EAN13 <> Неопределено Тогда
			НоменклатураСсылка = Номенклатура.Ссылка;			
			Штрихкод           = Строка.ШК_EAN13;			
			ВыполнитьРегистрациюНовогоШтрихкодаEAN13(ШтрихКод, НоменклатураСсылка);			
		КонецЕсли;	
		//Блок
		Если Строка.ШК_Блок <> Неопределено Тогда
			НоменклатураСсылка = Номенклатура.Ссылка;			
			Штрихкод           = Строка.ШК_Блок;			
			ВыполнитьРегистрациюНовогоШтрихкодаITF14(ШтрихКод, НоменклатураСсылка, ЕдиницаДляРегистрацииШтрихкодаБлока.Ссылка);			
		КонецЕсли;	
		//Груповая упаковка
		Если Строка.ШК_ITF14 <> Неопределено Тогда
			НоменклатураСсылка = Номенклатура.Ссылка;			
			Штрихкод           = Строка.ШК_ITF14;			
			ВыполнитьРегистрациюНовогоШтрихкодаITF14(ШтрихКод, НоменклатураСсылка, ЕдиницаДляРегистрацииШтрихкодаУпаковки.Ссылка);			
		КонецЕсли;	
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	КонецЦикла;		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначениеСвойства(Объект, Свойство, Значение)
	
	НаборЗаписейРегистра = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.Объект.Установить(Объект);
	НаборЗаписейРегистра.Отбор.Свойство.Установить(Свойство);
	
	СтрокаНабора = НаборЗаписейРегистра.Добавить();
	СтрокаНабора.Объект = Объект;
	СтрокаНабора.Свойство = Свойство;
	СтрокаНабора.Значение = Значение;
	
	НаборЗаписейРегистра.Записать();
	
КонецПроцедуры

&НаСервере
Функция СтавкаНДС(Ставка)
	
	Если Ставка = "18" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		Возврат СтавкаНДС;
	ИначеЕсли Ставка = "20" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		Возврат СтавкаНДС;
	ИначеЕсли Ставка = "10" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС10;
		Возврат СтавкаНДС;  
ИначеЕсли Ставка = "5" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС5;
		Возврат СтавкаНДС;
ИначеЕсли Ставка = "7" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС7;
		Возврат СтавкаНДС;
		
	КонецЕсли;
	
	Возврат 0;

КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьРегистрациюНовогоШтрихкодаEAN13(Штрихкод, Номенклатура)

	СтруктураШК = Новый Структура;
	СтруктураШК.Вставить("Владелец",         Номенклатура);	                              
	СтруктураШК.Вставить("Штрихкод",         Штрихкод);	 	
	СтруктураШК.Вставить("ТипШтрихкода",     ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13);	                              
	СтруктураШК.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаХраненияОстатков);	                              
	СтруктураШК.Вставить("Качество",         Справочники.Качество.Новый);	
	
	НоваяЗаписьШК = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяЗаписьШК, СтруктураШК);
	
	Попытка
		НоваяЗаписьШК.Записать();
	Исключение
		Возврат Ложь
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьРегистрациюНовогоШтрихкодаITF14(Штрихкод, Номенклатура, Единица)

	СтруктураШК = Новый Структура;
	СтруктураШК.Вставить("Владелец",         Номенклатура);	                              
	СтруктураШК.Вставить("Штрихкод",         Штрихкод);	 	
	СтруктураШК.Вставить("ТипШтрихкода",     ПланыВидовХарактеристик.ТипыШтрихкодов.ITF14);	                              
	СтруктураШК.Вставить("ЕдиницаИзмерения", Единица);	                              
	СтруктураШК.Вставить("Качество",         Справочники.Качество.Новый);	                              	
	
	НоваяЗаписьШК = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяЗаписьШК, СтруктураШК);
	
	Попытка
		НоваяЗаписьШК.Записать();
	Исключение
		Возврат Ложь
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЗагрузитьМетодом_MSADODB(Знач ФайлEXCEL, Знач ИмяЛиста, Знач СтрокаЗаголовка = 3, НачСтрока = 0, КонСтрока = 0, КолвоСтрокExcel, 
	Знач ПодключениеADODB = "MicrosoftJetOLEDB40") Экспорт
	Перем СonnectionString, ADODBConnection, ADODBRecordset, ТекстЗапроса;
	Перем КолвоКолонокExcel, Поле, Колонка, ИмяКолонки;
	Перем НоваяСтрока, НомерСтроки;
	Перем ТаблицаРезультат;
	
	// Нумерация MS ADODB начинается с 1.
	
	// Переменная "СтрокаЗаголовка", не используется, т.к. HDR=YES, а не HDR=NO.
	// HDR=YES:
	// 1. Считывание заголовков колонок с 1-ой строки.
	// 2. Считываемые данные со 2-ой и последующих строк типизированы. Для варианта HDR=NO: считываемые данные - строка.
	
	// Строка соединения - определение драйвера, который будет использован для подключения к файлу EXCEL.
	Если ПодключениеADODB = "MicrosoftACEOLEDB12" Тогда
		
		// ACE.OLEDB.12.0 - Для использования данного подключения необходимо дополнительное ПО:
		// Microsoft Access Database Engine 2010 Redistributable 32/64 bit.
		//Для корректной работы также установил:
		//http://www.microsoft.com/en-us/download/details.aspx?id=13255
		//http://www.microsoft.com/en-us/download/details.aspx?id=23734		
		
		СonnectionString = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 12.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	Иначе
		
		// Jet.OLEDB.4.0 - Стандартное подключение, как правило, не требующее установки дополнительного ПО. 
		// Рекомендуется установить последний Service Pack Windows.
		СonnectionString = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 8.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	КонецЕсли;
	
	Попытка
		// Инициализация основного объекта ADODB.Connection. Открытие соединения.
		ADODBConnection = Новый COMОбъект("ADODB.Connection");
		ADODBConnection.ConnectionString =  СonnectionString;
		ADODBConnection.Open();
		// Импирически определенный параметр для правильного определения количества строк листа.
		ADODBConnection.CursorLocation = 3;    // По-умолчанию 2.
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	ТекстЗапроса = "SELECT * FROM [" + ИмяЛиста + "$]";
	
	// Создание Recordset. Дочерний объект ADODBConnection. Набор записей по запросу.
	Попытка
		ADODBRecordset = Новый COMОбъект("ADODB.Recordset");
		ADODBRecordset.Open(ТекстЗапроса, ADODBConnection);
		
		// Проверка заполненности листа.
		Если (ADODBRecordset.EOF ИЛИ ADODBRecordset.BOF) Тогда
			КолвоСтрокExcel = 0;
			Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
			
			// Завершение работы.
			// Закрытие Объектов.
			ADODBRecordset.Close();
			ADODBConnection.Close();
			ADODBRecordset   = Неопределено;
			ADODBConnection = Неопределено;
			
			Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
		КонецЕсли;
		
		// Импирически определенные параметры для правильного определения количества строк листа.
		ADODBRecordset.AbsolutePage     = 1;
		ADODBRecordset.AbsolutePosition = 1;
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	// Параметр, возвращаемый в вызывающую процедуру.
	КолвоСтрокExcel = ADODBRecordset.RecordCount + 1;    // (+1) - учет Строки-Заголовока, которая "съедается".
	КолвоКолонокExcel = ADODBRecordset.Fields.Count;
	
	// Проверка заполненности листа.
	Если КолвоСтрокExcel <= 2 Тогда
		КолвоСтрокExcel = 0;
		Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
		
		// Завершение работы.
		// Закрытие Объектов.
		ADODBRecordset.Close();
		ADODBConnection.Close();
		ADODBRecordset   = Неопределено;
		ADODBConnection = Неопределено;
		
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецЕсли;
	
	// Создание результирующей таблицы, в которую будут записываться считанные из EXCEL данные.
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// Формирование колонок результирующей таблицы.
	
	// "НомерСтроки" - для наглядности и удобства.
	// В зависимости от разрабатываемой обработки.
	// "Сопоставлено" - может быть другим.
	// Здесь же могут быть добавлены другие колонки, не формируемые из содержимого файла EXCEL.
	
	//ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№", 4);
	//ТаблицаРезультат.Колонки.Добавить("Сопоставлено", Новый ОписаниеТипов("Булево"), "Сопоставлено", 1);
	
	Для ит = 1 ПО КолвоКолонокExcel Цикл
		
		Поле = ADODBRecordset.Fields.Item(ит - 1);
		ИмяКолонки = "К_" + ит;
		//ИмяКолонки = Поле.Value;
		//Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, , СокрЛП(СтрЗаменить(Поле.Name, "#", ".")));
		ИмяКолонки = ЗаменитьСимволы(ИмяКолонки);
		Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, ,ИмяКолонки);
		
		// Замена "#" на ".", т.к. при считывании ADODB "." в имени колонки заменяется на "#".
	КонецЦикла;
	
	// ТаблицаРезультат: 1-я строка - Строка-Заголовок.
	
	// Добавление этой строки обусловлено исключительно из соображений идентичности содержимого файла EXCEL и ТаблицыЗначений,
	// выводимой на форме Обработки, и дальнейшей обработки строки заголовка
	// с целью сопоставления колонок EXCEL и реквизитов 1С: для Справочников, ПВХ, Регистров, Документов.
	
	// Если в Вашей обработке в результирующей таблице в качестве 1-ой строки не нужна Строка-Заголовок, то
	// следует закомментировать следующий цикл:
	//НоваяСтрока = ТаблицаРезультат.Добавить();
	//НоваяСтрока.НомерСтроки = 1;
	//Для ит = 1 ПО КолвоКолонокExcel Цикл
	//	
	//	ИмяКолонки = "К_" + ит;
	//	Колонка = ТаблицаРезультат.Колонки.Найти(ИмяКолонки);
	//	НоваяСтрока[ИмяКолонки] = Колонка.Заголовок;
	//	
	//КонецЦикла;
	
	// ТаблицаРезультат: Формирование строк по указанному диапазону: НачСтрока - КонСтрока.
	
	НомерСтроки = 1;
	НачСтрока =  СтрокаЗаголовка+1;
	Пока ADODBRecordset.EOF() = 0 Цикл
		
		//НомерСтроки = НомерСтроки + 1;
		
		Если НомерСтроки < НачСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			ADODBRecordset.MoveNext();             // Следующая строка.
			//Продолжить;
			НомерСтроки = НомерСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		Если КонСтрока > 0 И НомерСтроки > КонСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			Прервать;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		//НоваяСтрока.НомерСтроки = НомерСтроки;
		
		Для ит = 1 ПО КолвоКолонокExcel Цикл
			
			Поле = ADODBRecordset.Fields.Item(ит - 1);
			
			Если Поле.ActualSize = 0 Тогда        // Пустое поле EXCEL.
				Продолжить;
			КонецЕсли;
			
			ЗначениеЯчейки = Поле.Value;        // Учитывая параметр HDR=YES в строке соединения, данные считываются в соответствии с их типом.
			
			ИмяКолонки = ит-1;
			НоваяСтрока[ИмяКолонки] = ЗначениеЯчейки;
			
			// Используется при формировании таблицы на форме обработки.
			//ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
			//ДлинаСтроки      = СтрДлина(СокрЛП(ЗначениеЯчейки));
			//ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
			
		КонецЦикла;
		
		ADODBRecordset.MoveNext();   // Следующая строка.
		
	КонецЦикла;
	
	//УдалитьКолонкиСНулевойШириной(ТаблицаРезультат);
	
	// Завершение работы.
	// Закрытие Объектов.
	ADODBRecordset.Close();
	ADODBConnection.Close();
	ADODBRecordset   = Неопределено;
	ADODBConnection = Неопределено;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Функция ЗаменитьСимволы(Стр)
	Стр = СтрЗаменить(Стр, " ", "");
	Стр = СтрЗаменить(Стр, "-", "");
	Стр = СтрЗаменить(Стр, "/", "");
	Стр = СтрЗаменить(Стр, ":", "");
	Стр = СтрЗаменить(Стр, ".", "");
	Стр = СтрЗаменить(Стр, "№", "");
	Стр = СтрЗаменить(Стр, "(", "");
	Стр = СтрЗаменить(Стр, ")", "");
	Возврат Стр;
КонецФункции


Функция СоздатьНоменклатуру (Артикул)

	НоменклатураСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул,,);
	
	Если НЕ НоменклатураСсылка = Справочники.Номенклатура.ПустаяСсылка()Тогда
		Сообщить("Номенклатура с артикулом: " + Артикул + " уже существует." );
		Возврат  НоменклатураСсылка;
	КонецЕсли;	
	
	Возврат НоменклатураСсылка; 	
КонецФункции
